Masmiseim36/nxpSDK/boards/frdmimxrt1186/ecat_examples/dual_cores_servo_motor/cm7/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of TP_J3_16 on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_18 (pin E6) */
  rgpio_pin_config_t TP_J3_16_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_18 (pin E6) */
  RGPIO_PinInit(RGPIO1, 18U, &TP_J3_16_config);

  /* GPIO configuration of TP_J3_18 on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_19 (pin D5) */
  rgpio_pin_config_t TP_J3_18_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_19 (pin D5) */
  RGPIO_PinInit(RGPIO1, 19U, &TP_J3_18_config);

  /* GPIO configuration of LED_GREEN_CTL on GPIO_EMC_B1_11 (pin F2) */
  rgpio_pin_config_t LED_GREEN_CTL_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_11 (pin F2) */
  RGPIO_PinInit(RGPIO2, 11U, &LED_GREEN_CTL_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_GPIO2_IO11,       /* GPIO_EMC_B1_11 is configured as GPIO2_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_18_GPIO1_IO18,          /* GPIO_AON_18 is configured as GPIO1_IO18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_19_GPIO1_IO19,          /* GPIO_AON_19 is configured as GPIO1_IO19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_19_GPIO1_IO19,          /* GPIO_AON_19 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G6, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_12, identifier: M1_PWM_AT}
  - {pin_num: F3, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_13, identifier: M1_PWM_AB}
  - {pin_num: G5, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_14, identifier: M1_PWM_BT}
  - {pin_num: G2, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_B1_15, identifier: M1_PWM_BB}
  - {pin_num: E2, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_17, identifier: M1_PWM_CT}
  - {pin_num: H1, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_B1_16, identifier: M1_PWM_CB}
  - {pin_num: C15, peripheral: PWM4, signal: 'FAULT, 0', pin_signal: GPIO_SD_B1_03, identifier: M1_OC_FAULT}
  - {pin_num: P1, peripheral: PWM4, signal: 'FAULT, 1', pin_signal: GPIO_EMC_B1_39, identifier: M1_OV_FAULT}
  - {pin_num: D1, peripheral: PWM2, signal: 'A, 0', pin_signal: GPIO_EMC_B1_18, identifier: M2_PWM_AT}
  - {pin_num: F4, peripheral: PWM2, signal: 'B, 0', pin_signal: GPIO_EMC_B1_19, identifier: M2_PWM_AB}
  - {pin_num: G1, peripheral: PWM2, signal: 'A, 1', pin_signal: GPIO_EMC_B1_20}
  - {pin_num: K4, peripheral: PWM2, signal: 'B, 1', pin_signal: GPIO_EMC_B1_21, identifier: M2_PWM_BB}
  - {pin_num: F1, peripheral: PWM2, signal: 'A, 2', pin_signal: GPIO_EMC_B1_23}
  - {pin_num: L3, peripheral: PWM2, signal: 'B, 2', pin_signal: GPIO_EMC_B1_22}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 0', pin_signal: FLEXPWM4_PWM1_OUT_TRIG0_1}
  - {pin_num: H6, peripheral: PWM2, signal: 'FAULT, 0', pin_signal: GPIO_EMC_B1_05, identifier: M2_OC_FAULT}
  - {pin_num: J4, peripheral: PWM2, signal: 'FAULT, 1', pin_signal: GPIO_EMC_B1_04, identifier: M2_OV_FAULT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_15_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8(0x00U) /* IOMUXC XBAR_INOUT8 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9(0x00U) /* IOMUXC XBAR_INOUT9 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_15(0x00U) /* IOMUXC XBAR_INOUT15 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23(0x00U) /* IOMUXC XBAR_INOUT23 function direction select: XBAR_INOUT as input */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_XBAR1_XBAR_INOUT08,  /* GPIO_EMC_B1_04 is configured as XBAR1_XBAR_INOUT08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_XBAR1_XBAR_INOUT09,  /* GPIO_EMC_B1_05 is configured as XBAR1_XBAR_INOUT09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXPWM4_PWMA00,  /* GPIO_EMC_B1_12 is configured as FLEXPWM4_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_FLEXPWM4_PWMB00,  /* GPIO_EMC_B1_13 is configured as FLEXPWM4_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_14_FLEXPWM4_PWMA01,  /* GPIO_EMC_B1_14 is configured as FLEXPWM4_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_15_FLEXPWM4_PWMB01,  /* GPIO_EMC_B1_15 is configured as FLEXPWM4_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_16_FLEXPWM4_PWMB02,  /* GPIO_EMC_B1_16 is configured as FLEXPWM4_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_17_FLEXPWM4_PWMA02,  /* GPIO_EMC_B1_17 is configured as FLEXPWM4_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_18_FLEXPWM2_PWMA00,  /* GPIO_EMC_B1_18 is configured as FLEXPWM2_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_19_FLEXPWM2_PWMB00,  /* GPIO_EMC_B1_19 is configured as FLEXPWM2_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_20_FLEXPWM2_PWMA01,  /* GPIO_EMC_B1_20 is configured as FLEXPWM2_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_21_FLEXPWM2_PWMB01,  /* GPIO_EMC_B1_21 is configured as FLEXPWM2_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_22_FLEXPWM2_PWMB02,  /* GPIO_EMC_B1_22 is configured as FLEXPWM2_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_23_FLEXPWM2_PWMA02,  /* GPIO_EMC_B1_23 is configured as FLEXPWM2_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_39_XBAR1_XBAR_INOUT15,  /* GPIO_EMC_B1_39 is configured as XBAR1_XBAR_INOUT15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_03_XBAR1_XBAR_INOUT23,  /* GPIO_SD_B1_03 is configured as XBAR1_XBAR_INOUT23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm1OutTrig01, kXBAR1_OutputFlexpwm2ExtSync0); /* FLEXPWM4_PWM1_OUT_TRIG0_1 output assigned to XBAR1_IN91 input is connected to XBAR1_OUT60 output assigned to FLEXPWM2_EXT_SYNC0 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout09, kXBAR1_OutputFlexpwm2Fault0); /* IOMUX_XBAR_INOUT09 output assigned to XBAR1_IN9 input is connected to XBAR1_OUT65 output assigned to FLEXPWM2_FAULT0 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout08, kXBAR1_OutputFlexpwm2Fault1); /* IOMUX_XBAR_INOUT08 output assigned to XBAR1_IN8 input is connected to XBAR1_OUT66 output assigned to FLEXPWM2_FAULT1 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout23, kXBAR1_OutputFlexpwm4Fault0); /* IOMUX_XBAR_INOUT23 output assigned to XBAR1_IN23 input is connected to XBAR1_OUT84 output assigned to FLEXPWM4_FAULT0 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout15, kXBAR1_OutputFlexpwm4Fault1); /* IOMUX_XBAR_INOUT15 output assigned to XBAR1_IN15 input is connected to XBAR1_OUT85 output assigned to FLEXPWM4_FAULT1 */
}


