Masmiseim36/nxpSDK/boards/frdmimxrt1186/ecat_examples/dual_cores_servo_motor/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPUART:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, pull_keeper_select: Keeper}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPUART, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPUART(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: H3, peripheral: FLEXIO1, signal: 'IO, 00', pin_signal: GPIO_EMC_B1_00, identifier: M1_ENDATA_DATA_IN_ENC_A}
  - {pin_num: H4, peripheral: FLEXIO1, signal: 'IO, 01', pin_signal: GPIO_EMC_B1_01, identifier: M1_ENDAT_DIR_ENC_B}
  - {pin_num: G3, peripheral: FLEXIO1, signal: 'IO, 03', pin_signal: GPIO_EMC_B1_03}
  - {pin_num: K2, peripheral: FLEXIO1, signal: 'IO, 02', pin_signal: GPIO_EMC_B1_02}
  - {peripheral: TRIGGER_SYNC, signal: 'SYNC_IN, 0', pin_signal: FLEXPWM4_PWM2_OUT_TRIG0_1}
  - {peripheral: FLEXIO1, signal: 'TRIG_IN, 0', pin_signal: TRIGGER_SYNC_OUT0}
  - {pin_num: N16, peripheral: FLEXIO2, signal: 'IO, 15', pin_signal: GPIO_AD_15}
  - {pin_num: N14, peripheral: FLEXIO2, signal: 'IO, 14', pin_signal: GPIO_AD_14, identifier: M2_ENDAT_DIR_ENC_B}
  - {pin_num: P17, peripheral: FLEXIO2, signal: 'IO, 12', pin_signal: GPIO_AD_12, identifier: M2_ENDAT_DATA_OUT_ENC_HOME}
  - {pin_num: N15, peripheral: FLEXIO2, signal: 'IO, 13', pin_signal: GPIO_AD_13, identifier: M2_ENDAT_CLK_ENC_I}
  - {peripheral: FLEXIO2, signal: 'TRIG_IN, 0', pin_signal: TRIGGER_SYNC_OUT1}
  - {peripheral: TRIGGER_SYNC, signal: 'SYNC_IN, 1', pin_signal: FLEXPWM2_PWM1_OUT_TRIG0_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_FLEXIO2_FLEXIO12,     /* GPIO_AD_12 is configured as FLEXIO2_FLEXIO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_FLEXIO2_FLEXIO13,     /* GPIO_AD_13 is configured as FLEXIO2_FLEXIO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_14_FLEXIO2_FLEXIO14,     /* GPIO_AD_14 is configured as FLEXIO2_FLEXIO14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_FLEXIO2_FLEXIO15,     /* GPIO_AD_15 is configured as FLEXIO2_FLEXIO15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXIO1_FLEXIO00,  /* GPIO_EMC_B1_00 is configured as FLEXIO1_FLEXIO00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_FLEXIO1_FLEXIO01,  /* GPIO_EMC_B1_01 is configured as FLEXIO1_FLEXIO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXIO1_FLEXIO02,  /* GPIO_EMC_B1_02 is configured as FLEXIO1_FLEXIO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_FLEXIO1_FLEXIO03,  /* GPIO_EMC_B1_03 is configured as FLEXIO1_FLEXIO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm2OutTrig01, kXBAR1_OutputTriggerSyncIn0); /* FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBAR1_IN92 input is connected to XBAR1_OUT30 output assigned to TRIGGER_SYNC_IN0 */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm2Pwm1OutTrig01, kXBAR1_OutputTriggerSyncIn1); /* FLEXPWM2_PWM1_OUT_TRIG0_1 output assigned to XBAR1_IN83 input is connected to XBAR1_OUT31 output assigned to TRIGGER_SYNC_IN1 */
  XBAR_SetSignalsConnection(kXBAR1_InputTriggerSyncOut0, kXBAR1_OutputFlexio1TrigIn0); /* TRIGGER_SYNC_OUT0 output assigned to XBAR1_IN106 input is connected to XBAR1_OUT152 output assigned to FLEXIO1_TRIG_IN0 */
  XBAR_SetSignalsConnection(kXBAR1_InputTriggerSyncOut1, kXBAR1_OutputFlexio2TrigIn0); /* TRIGGER_SYNC_OUT1 output assigned to XBAR1_IN107 input is connected to XBAR1_OUT154 output assigned to FLEXIO2_TRIG_IN0 */
}


